<a href="https://colab.research.google.com/github/naomori/codexa_Pandas_Introduction/blob/master/Chapter5.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# CSVデータの読み込み

In [2]:
!wget https://www.codexa.net/wp-content/uploads/2017/12/002-1.csv
!wget https://www.codexa.net/wp-content/uploads/2017/12/002-2.csv

--2019-07-26 03:02:42--  https://www.codexa.net/wp-content/uploads/2017/12/002-1.csv
Resolving www.codexa.net (www.codexa.net)... 54.64.62.39, 13.115.61.79
Connecting to www.codexa.net (www.codexa.net)|54.64.62.39|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: 3561 (3.5K) [application/octet-stream]
Saving to: ‘002-1.csv’

002-1.csv           100%[===================>]   3.48K  --.-KB/s    in 0s

2019-07-26 03:02:43 (482 MB/s) - ‘002-1.csv’ saved [3561/3561]

--2019-07-26 03:02:44--  https://www.codexa.net/wp-content/uploads/2017/12/002-2.csv
Resolving www.codexa.net (www.codexa.net)... 54.64.62.39, 13.115.61.79
Connecting to www.codexa.net (www.codexa.net)|54.64.62.39|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: 3428 (3.3K) [application/octet-stream]
Saving to: ‘002-2.csv’

002-2.csv           100%[===================>]   3.35K  --.-KB/s    in 0s

2019-07-26 03:02:44 (365 MB/s) - ‘002-2.csv’ saved [3428/3428]

In [0]:
import numpy as np
import matplotlib.pyplot as plt
import pandas as pd

In [4]:
df = pd.read_csv('002-1.csv')
df.head()

   0.563823406  0.926037583  0.564529862
0     0.226930     0.774618     0.415330
1     0.993598     0.030036     0.210686
2     0.355566     0.824691     0.629814
3     0.784904     0.614295     0.127989
4     0.442514     0.163834     0.088494

一行目がカラム名として認識されてしまっているので、ヘッダなしとします。

In [6]:
df = pd.read_csv('002-1.csv', header=None)
df.head()

          0         1         2
0  0.563823  0.926038  0.564530
1  0.226930  0.774618  0.415330
2  0.993598  0.030036  0.210686
3  0.355566  0.824691  0.629814
4  0.784904  0.614295  0.127989

In [7]:
type(df)

pandas.core.frame.DataFrame

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 3 columns):
0    100 non-null float64
1    100 non-null float64
2    100 non-null float64
dtypes: float64(3)
memory usage: 2.4 KB

In [9]:
df.describe()

                0           1           2
count  100.000000  100.000000  100.000000
mean     0.460883    0.487668    0.507878
std      0.278284    0.306104    0.295137
min      0.008179    0.005217    0.012975
25%      0.221251    0.209450    0.202979
50%      0.428495    0.455401    0.548508
75%      0.700257    0.761196    0.808566
max      0.994047    0.999703    0.980560

In [0]:
df2 = pd.read_csv('002-2.csv')

In [11]:
df2.head()

  Employee ID  Evaluation  Promotion Salary in JPY (Date:2001-2017)  Quit
0         565         0.1        1.0                            Low   1.0
1         141         0.1        0.0                            Low   1.0
2         786         0.6        1.0                            Low   0.0
3        1770         1.0        1.0                            Low   0.0
4         662         1.0        0.0                            Low   0.0

In [12]:
df2.shape

(201, 5)

In [13]:
df2.tail()

                                           Employee ID  ...  Quit
196                                                596  ...   0.0
197                                               1729  ...   0.0
198                                               1137  ...   0.0
199                                                NaN  ...   1.0
200  All employees data is collected annonimously, ...  ...   NaN

[5 rows x 5 columns]

199, 200 行について、データが空だったり、注釈が入っていたりする。
データを読み込む際に、これらのデータを読み飛ばすようにする。
skipfooter で２行を読み飛ばすことができる。

In [0]:
df2 = pd.read_csv('002-2.csv', skipfooter=2, engine="python")

In [18]:
df2.tail()

     Employee ID  Evaluation  Promotion Salary in JPY (Date:2001-2017)  Quit
194          766         1.0          0                            Mid     1
195         2350         0.0          0                            Mid     1
196          596         0.2          0                            Mid     0
197         1729         0.1          0                            Mid     0
198         1137         1.0          1                            Mid     0

In [19]:
df2.head()

   Employee ID  Evaluation  Promotion Salary in JPY (Date:2001-2017)  Quit
0          565         0.1          1                            Low     1
1          141         0.1          0                            Low     1
2          786         0.6          1                            Low     0
3         1770         1.0          1                            Low     0
4          662         1.0          0                            Low     0

In [20]:
df2.columns

Index(['Employee ID', 'Evaluation', 'Promotion',
       'Salary in JPY (Date:2001-2017)', 'Quit'],
      dtype='object')

In [21]:
df2.index

RangeIndex(start=0, stop=199, step=1)

In [0]:
df2.columns = ["ID", "Evaluation", "Promotion", "Salaray", "Quit"]

In [23]:
df2.head()

     ID  Evaluation  Promotion Salaray  Quit
0   565         0.1          1     Low     1
1   141         0.1          0     Low     1
2   786         0.6          1     Low     0
3  1770         1.0          1     Low     0
4   662         1.0          0     Low     0

In [0]:
df2["Sex"] = "Male"

In [29]:
df2.head()

     ID  Evaluation  Promotion Salaray  Quit   Sex
0   565         0.1          1     Low     1  Male
1   141         0.1          0     Low     1  Male
2   786         0.6          1     Low     0  Male
3  1770         1.0          1     Low     0  Male
4   662         1.0          0     Low     0  Male

In [30]:
df2.head(20)

      ID  Evaluation  Promotion Salaray  Quit   Sex
0    565         0.1          1     Low     1  Male
1    141         0.1          0     Low     1  Male
2    786         0.6          1     Low     0  Male
3   1770         1.0          1     Low     0  Male
4    662         1.0          0     Low     0  Male
5   1674         0.8          1     Low     0  Male
6    828         0.9          1     Low     1  Male
7   2287         0.9          1     Low     0  Male
8   1743         0.5          0     Low     0  Male
9    988         0.6          0     Low     0  Male
10   273         0.8          0     Low     1  Male
11  1993         0.5          0     Low     1  Male
12  1252         0.9          1     Low     0  Male
13  1349         0.7          1     Low     0  Male
14   825         0.3          1     Low     0  Male
15   110         1.0          0     Low     0  Male
16  2020         0.5          0    High     0  Male
17  1672         0.4          1    High     1  Male
18   767         0.4          1    High     1  Male
19  2218         0.3          1    High     0  Male

In [31]:
df2.describe()

                ID  Evaluation   Promotion        Quit
count   199.000000  199.000000  199.000000  199.000000
mean   1204.874372    0.474874    0.180905    0.547739
std     696.072589    0.322665    0.385910    0.498971
min       4.000000    0.000000    0.000000    0.000000
25%     601.500000    0.200000    0.000000    0.000000
50%    1146.000000    0.400000    0.000000    1.000000
75%    1839.500000    0.800000    0.000000    1.000000
max    2493.000000    1.000000    1.000000    1.000000

df.corr()は相関関係を表す

In [32]:
df2.corr()

                  ID  Evaluation  Promotion      Quit
ID          1.000000   -0.020596   0.119456 -0.118589
Evaluation -0.020596    1.000000   0.231375  0.029446
Promotion   0.119456    0.231375   1.000000 -0.228676
Quit       -0.118589    0.029446  -0.228676  1.000000

In [0]:
eva = df2.groupby('Evaluation')

In [34]:
type(eva)

pandas.core.groupby.generic.DataFrameGroupBy

DataFrameGroupBy は、グルービングによるデータを集計できる

In [36]:
eva.mean()

                     ID  Promotion      Quit
Evaluation
0.0         1306.666667   0.000000  0.555556
0.1         1189.466667   0.066667  0.666667
0.2         1102.656250   0.031250  0.718750
0.3         1296.157895   0.157895  0.368421
0.4         1265.230769   0.307692  0.307692
0.5         1390.692308   0.153846  0.153846
0.6         1343.294118   0.411765  0.235294
0.7         1128.300000   0.200000  0.400000
0.8          985.600000   0.333333  0.600000
0.9         1239.360000   0.280000  0.800000
1.0         1125.000000   0.187500  0.687500